)ATTR
_ TYPE(INPUT)   INTENS(HIGH) COLOR(YELLOW)
% TYPE(TEXT)    COLOR(RED)
* TYPE(TEXT)    COLOR(YELLOW)
+ TYPE(TEXT)    COLOR(WHITE)
# TYPE(OUTPUT)  INTENS(HIGH) COLOR(BLUE)
? TYPE(OUTPUT)  INTENS(HIGH) COLOR(RED)
@ TYPE(OUTPUT)  COLOR(RED)
)BODY WINDOW(53,5)
%
%  -----------------------------------------------
%  |?info                                       *|
%  -----------------------------------------------
%
)INIT
&ZCMD= ' '
&ZWINTTL=  'Information Panel'
)REINIT
&ZCMD= ' '
)PROC
)END
