//SBGOLOBL  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//* GET RETURN CODE WHICH DEPENDS ON THE OPERATING SYSTEM LEVEL
//*  (MORE JOB STEPS CAN FOLLOW, WHICH DEPEND ON THE RETCODE)
//*
//TSOBATCH EXEC PGM=IKJEFT01
//STEPLIB DD DISP=SHR,DSN=SYS1.CBT.LINKLIB
//SYSTSPRT DD DUMMY
//SYSTSIN DD *
 GETOSLVL
/*
//
